Revit 2024 API
Document.Equals Method
 Determines whether the specified Object equals to this Object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override bool Equals(
	Object obj
)
Visual Basic
Public Overrides Function Equals ( _
	obj As Object _
) As Boolean
Visual C++
public:
virtual bool Equals(
	Object^ obj
) override
Parameters
obj
Type: System.Object
Remarks
 Two document instances are considered equal if they represent the same document currently opened in the Revit session.
See Also
Document Class
Autodesk.Revit.DB Namespace